; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v6 - type_1 ?v8 - type_3)
 	      (pred_4 ?v1 - object ?v8 - type_3)
	      (pred_1 ?v6 - type_1 ?v3 - type_2)
	      (pred_2 ?v6 - type_1 ?v1 - object ?v3 - type_2))

   (:action op_3
       :parameters  (?v6 - type_1 ?v7 ?v4 - type_3)
       :precondition (and  (pred_3 ?v6 ?v7))
       :effect (and  (pred_3 ?v6 ?v4)
		     (not (pred_3 ?v6 ?v7))))

   (:action op_2
       :parameters (?v6 - type_1 ?v2 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v2 ?v5) (pred_3 ?v6 ?v5) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v2 ?v3)
		    (not (pred_4 ?v2 ?v5)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_1
       :parameters (?v6 - type_1 ?v2 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v2 ?v3) (pred_3 ?v6 ?v5))
       :effect (and (pred_4 ?v2 ?v5)
		    (pred_1 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v2 ?v3)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_02 obj_09 - type_1
obj_08 obj_11 obj_03 obj_04 - type_2
obj_05 obj_06 obj_01 obj_12 - type_3
obj_14 obj_13 obj_07 obj_10 - object)
(:init
(pred_3 obj_02 obj_01)
(pred_1 obj_02 obj_08)
(pred_1 obj_02 obj_11)
(pred_3 obj_09 obj_12)
(pred_1 obj_09 obj_03)
(pred_1 obj_09 obj_04)
(pred_4 obj_14 obj_01)
(pred_4 obj_13 obj_06)
(pred_4 obj_07 obj_01)
(pred_4 obj_10 obj_12)
)
(:goal
(and
(pred_4 obj_14 obj_12)
(pred_4 obj_13 obj_12)
(pred_4 obj_07 obj_01)
(pred_4 obj_10 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_02 obj_12)))
)
)

; plan
1. (op_2 obj_02 obj_14 obj_01 obj_11)
   deleted: (pred_4 obj_14 obj_01) (pred_1 obj_02 obj_11)
   added: (pred_2 obj_02 obj_14 obj_11)
   goals met: 2 of 4
2. (op_3 obj_09 obj_12 obj_06)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_06)
   goals met: 2 of 4
3. (op_3 obj_02 obj_01 obj_06)
   deleted: (pred_3 obj_02 obj_01)
   added: (pred_3 obj_02 obj_06)
   goals met: 2 of 4
4. (op_2 obj_02 obj_13 obj_06 obj_08)
   deleted: (pred_4 obj_13 obj_06) (pred_1 obj_02 obj_08)
   added: (pred_2 obj_02 obj_13 obj_08)
   goals met: 2 of 4
5. (op_1 obj_02 obj_14 obj_06 obj_11)
   deleted: (pred_2 obj_02 obj_14 obj_11)
   added: (pred_4 obj_14 obj_06) (pred_1 obj_02 obj_11)
   goals met: 2 of 4
6. (op_2 obj_09 obj_14 obj_06 obj_04)
   deleted: (pred_4 obj_14 obj_06) (pred_1 obj_09 obj_04)
   added: (pred_2 obj_09 obj_14 obj_04)
   goals met: 2 of 4
7. (op_1 obj_02 obj_13 obj_06 obj_08)
   deleted: (pred_2 obj_02 obj_13 obj_08)
   added: (pred_4 obj_13 obj_06) (pred_1 obj_02 obj_08)
   goals met: 2 of 4
8. (op_3 obj_09 obj_06 obj_12)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_12)
   goals met: 2 of 4
9. (op_1 obj_09 obj_14 obj_12 obj_04)
   deleted: (pred_2 obj_09 obj_14 obj_04)
   added: (pred_4 obj_14 obj_12) (pred_1 obj_09 obj_04)
   goals met: 3 of 4
10. (op_3 obj_09 obj_12 obj_06)
   deleted: (pred_3 obj_09 obj_12)
   added: (pred_3 obj_09 obj_06)
   goals met: 3 of 4
11. (op_2 obj_09 obj_13 obj_06 obj_04)
   deleted: (pred_4 obj_13 obj_06) (pred_1 obj_09 obj_04)
   added: (pred_2 obj_09 obj_13 obj_04)
   goals met: 3 of 4
12. (op_3 obj_09 obj_06 obj_12)
   deleted: (pred_3 obj_09 obj_06)
   added: (pred_3 obj_09 obj_12)
   goals met: 3 of 4
13. (op_1 obj_09 obj_13 obj_12 obj_04)
   deleted: (pred_2 obj_09 obj_13 obj_04)
   added: (pred_4 obj_13 obj_12) (pred_1 obj_09 obj_04)
   goals met: 4 of 4
